
x=0;%这里的作用是该页最下方设置循环变量
k=1;
while k==1
  %============路口之前车辆更新========================================%
  %也就是42行在路口之前是怎么更新的
  
 A=B(42,:);%单独取出来第42行
for i=121:-1:1%i从42开始，递减1，一直到1
      if A(i)==0.01&A(i-1)==0&A(i-2)==0
          A(i-1)=0.02;
          A(i-2)=0.02;
      end
      
      if A(i)==0.02&A(i-1)==0&A(i-2)==0
          A(i-1)=0.01;
          A(i-2)=0.01;
      end
      
       if A(i)==0&A(i+1)==0.01
          A(i)=0.02;
       end
      
      if A(i)==0&A(i+1)==0.02
          A(i)=0.01;
      end
    %以上的三个if end语句是消散时车尾那儿的车辆继续排队用的  
      if A(i)==0
          A(i)=1;
           A(i+1)=0;
      end
  %上面这个if end：假如i位置处是0有车，那么下一时刻变成1无车，并且i+1位置处变0有车，效果是车往前走了一格   
  end
  %============路口之前车辆更新========================================%  
  A=[round(5*rand(1,1)) A(:,2:end)];%矩阵A也即是第42行，第一列那个不要，用随机产生的一个数来代替，组成新的A
  A(A(1,1)~=0)=1;%因为第一列那个地方元素是随机生成的介于[0,1)之间的数，这行语句可以把产生的随机数不是0的话就变成1，这样第一列位置处，或者有车0.或者没车1
  B(42,:)=A;%重新把处理后的A给整个大矩阵原路赋值回去
  
  A=B(84,:);%单独取出来第42行
for i=121:-1:1%i从42开始，递减1，一直到1
      if A(i)==0.01&A(i-1)==0&A(i-2)==0
          A(i-1)=0.02;
          A(i-2)=0.02;
      end
      
      if A(i)==0.02&A(i-1)==0&A(i-2)==0
          A(i-1)=0.01;
          A(i-2)=0.01;
      end
      
       if A(i)==0&A(i+1)==0.01
          A(i)=0.02;
       end
      
      if A(i)==0&A(i+1)==0.02
          A(i)=0.01;
      end
    %以上的三个if end语句是消散时车尾那儿的车辆继续排队用的  
      if A(i)==0
          A(i)=1;
           A(i+1)=0;
      end
  %上面这个if end：假如i位置处是0有车，那么下一时刻变成1无车，并且i+1位置处变0有车，效果是车往前走了一格   
  end
  %============路口之前车辆更新========================================%  
  A=[round(5*rand(1,1)) A(:,2:end)];%矩阵A也即是第42行，第一列那个不要，用随机产生的一个数来代替，组成新的A
  A(A(1,1)~=0)=1;%因为第一列那个地方元素是随机生成的介于[0,1)之间的数，这行语句可以把产生的随机数不是0的话就变成1，这样第一列位置处，或者有车0.或者没车1
  B(84,:)=A;%重新把处理后的A给整个大矩阵原路赋值回去 
  
  B=nanbei(B);
  B=youzuo(B);%这也是一个调用，不同的是这个调用后必须返回一个矩阵B，这里的意思是，拿着矩阵B去调用youzuo这个函数，完了之后要返回一个处理后的矩阵B
  B=beinan(B);
  set(H,'CData',B); %到这就显示了一次更新一次后的图像
  pause(0.1); %暂停0.1秒
  B=lukouchu(B);%调用，作用是处理那些到达路口处的车辆，控制它到底是直行还是左转右转，处理完后返回处理后的矩阵B
  for j=122:-1:2
      if B(42,j)==0.01&B(42,j-1)==0.01&B(42,j+1)==1&B(42,j+2)==1
          B(42,j)=0;
          B(42,j-1)=0;
      end
     if B(42,j)==0.02&B(42,j-1)==0.02&B(42,j+1)==1&B(42,j+2)==1
          B(42,j)=0;
          B(42,j-1)=0;
     end
      if B(42,j)==0.01&B(42,j-1)~=0.01&B(42,j+1)==1&B(42,j+2)==1
          B(42,j)=0;
      end
      if B(42,j)==0.02&B(42,j-1)~=0.02&B(42,j+1)==1&B(42,j+2)==1
          B(42,j)=0;
      end
  end
  for j=2:121
      if B(41,j)==0.01&B(41,j+1)==0.01&B(41,j-1)==1&B(41,j-2)==1
          B(41,j)=0;
          B(41,j+1)=0;
      end
      if B(41,j)==0.02&B(41,j+1)==0.02&B(41,j-1)==1&B(41,j-2)==1
          B(41,j)=0;
          B(41,j+1)=0;
      end
      if B(41,j)==0.01&B(41,j+1)~=0.01&B(41,j-1)==1&B(41,j-2)==1
          B(41,j)=0;
      end
      if B(41,j)==0.02&B(41,j+1)~=0.02&B(41,j-1)==1&B(41,j-2)==1
          B(41,j)=0;
      end
  end
  
   for j=122:-1:2
      if B(84,j)==0.01&B(84,j-1)==0.01&B(84,j+1)==1&B(84,j+2)==1
          B(84,j)=0;
          B(84,j-1)=0;
      end
     if B(84,j)==0.02&B(84,j-1)==0.02&B(84,j+1)==1&B(84,j+2)==1
          B(84,j)=0;
          B(84,j-1)=0;
     end
      if B(84,j)==0.01&B(84,j-1)~=0.01&B(84,j+1)==1&B(84,j+2)==1
          B(84,j)=0;
      end
      if B(84,j)==0.02&B(84,j-1)~=0.02&B(84,j+1)==1&B(84,j+2)==1
          B(84,j)=0;
      end
  end
  
  
  for j=2:121
      if B(83,j)==0.01&B(83,j+1)==0.01&B(83,j-1)==1&B(83,j-2)==1
          B(83,j)=0;
          B(83,j+1)=0;
      end
      if B(83,j)==0.02&B(83,j+1)==0.02&B(83,j-1)==1&B(83,j-2)==1
          B(83,j)=0;
          B(83,j+1)=0;
      end
      if B(83,j)==0.01&B(83,j+1)~=0.01&B(83,j-1)==1&B(83,j-2)==1
          B(83,j)=0;
      end
      if B(83,j)==0.02&B(83,j+1)~=0.02&B(83,j-1)==1&B(83,j-2)==1
          B(83,j)=0;
      end
  end
  
  
  %上面这个for ens语句是消散排队用的，可以等到看完排队代码程序又跳转回这儿时再看
   x=x+1;
  if x>1000
      xiaosan(B,H)
  end
  %上面这个判断语句作用就是绿灯时间，更新200次，然后就调用youcehongdeng那个函数，直接跳转的不用再返回
  end
  

  
  
  
  